// Лабораторная 3, задача 8. Выполнена: Скроба А.П.

/* Числа Армстронга (названные в честь Майкла Ф. Армстронга
(Michael F. Armstrong)), их также называют самовлюбленными числами и
совершенными цифровыми инвариантами, – это числа, равные сумме своих
цифр, возведенных в степень, равную количеству цифр. Например, наименьшее
число Армстронга – 153, которое равно 1^3 + 5^3 + 3^3 . Напишите программу,
которая выводит все числа армстронга меньше 10^6 */

#include<iostream>
#include<cmath>
using namespace std;

int main() {
	setlocale(LC_ALL, "Rus");

	int x , n = 1, r, sum = 0, temp, a;
	

	return 0;
}